//2019년 한국정보올림피아드 1차대회 초등부 1번 -막대기
//N개의 막대기에 대한 높이 정보가 주어질 때, 오른쪽에서 보아서 몇개가 보이는지를 알아내는 프로그램을 작성

//입력방식
//표준 입력으로 다음 정보가 주어딘다. 첫 번째 줄에는 막대기의 개수를 나타내는 정수 N(2 <= N =<100000)이 주어지고
// 이어디는 N줄 각각엔 막대기의 높이를 나타내는 정수 h(2 <= h =<100000)가 주어진다. 

//출력형식
//표준 출력으로 오른쪽에서 N개의 막대기를 보았을때, 보이는 막대기의 개수를 출력한다.

#include <stdio.h>
#include <stdlib.h> //malloc(), free()를 위해 필요

int main(void){
	
	int N = 0;
	int nsize = 0;
	int cnt = 0; //체크 막대기보다 큰 마대기 수 세는 변수
	int chk ;//체크 기준이 될 막대기 변수
	int i = 0;
	
	//막대기의 수를 입력받는다.
	printf("막대기의 개수를 정해주세요: ");
	scanf("%d", &N);
	
	if(N>=2 && N<=10000000){
		
		//막대기 수에 해당하는 동적메모리를 설정한다.
		int *M=(int *)malloc(sizeof(int)*N);
		
		//설정한 동적메모리에 막대기의 크기를 입력한다.
		for(i=0; i<N; i++){
			printf("%d: ", i+1);
			scanf("%d", &nsize);
			if(nsize >=1 && nsize<=100000){
				M[i] = nsize;
			}else{
				return 0; //프로그램 종료
			}
		}
		
		//마지막의 막대기를 체크막대기로 정하고
		//체크 막대기보다 큰 막대기들을 찾는다.
		cnt = 1;
		chk=M[N-1];
		for(i=N-2; i>=0;i--){
			if(M[i]>chk){
				cnt++;
				chk=M[i];//체크막대기를 교체한다.
			}
		}
		//결과 출력
		printf("\n보이는 막대기의 개수: %d\n", cnt);
		
		//설정된 동적메모리를 해제한다.
		free(M);
	}
		
	return 0;

}