//문제

//공들을 바구니에 나눠 담기 위한 규칙들을 정리하면 
//1) N개의 공을 K개의  마구니에 빠짐없이 나누어 담는다.
//2) 각 바구니에는 1개 이상의 공이 들억 있어야 한다.
//3) 각 바구니에 담긴 공들의개수는 모두 달라야 한다.
//4) 가장 많이 담신 바구니와 가장 적게 담긴 바구니의 공의 개수 차이가 최소가 되어야 한다.

//입력 형식
//공이 개수를 나다태는 N(N>=2 && N<= 100,000)정수
//팀 수를 나타내는 K(K>=2 && K <= 1,000)의 정수 

//출력형식
//N개의 공들을 K개의 바구니에 문제의 규칙을 맞곡하면서 나눠 담을 수 있다면,
//가장 많이 담긴 바구니와 가장 적게 담신 바구니의 공의 개수 차이를 출력하라.
//N개의 공들을 K개의 바구니에 문제의 규칙을 만족하면서 나눠 담을 수 없다며, -1을 출력한다.

#include <stdio.h>

int main(void){
	
	int N,K;
	
	scanf("%d %d", &N, &K);
	if((N>=2 && N<=100000) && (K>=2 && K<=1000)){
		//공의 수가 팀수에 나눠지도록 한다.
		N -= K*(K+1)/2;
		
		//공수가 0보다 작으면 규칙에 만족하지 않으면 -1을 출력
		//그렇지 않으면 공의 개수 차이를 출력한다.
		
		if(N<0)
			printf("-1\n");
		else
			printf("%d\n", K-1+(N % K !=0));
	}
	
	return 0;

}
